#include <stdio.h>

int main(void)
{
	//2차원 배열
	if (0)
	{
		//int ar1[4][5] = {10, 20, 30, 40, 50, 60, 70, 80, 90, 100 };
		int ar1[4][5] = { {10, 20}, {30, 40 }, { 50, 60, 70, 80 }, { 90, 100 } };

		int i, j;

		for (i = 0; i < 4; i++)//행
		{
			for (j = 0; j < 5; j++)//열
			{
				printf("%d\t", ar1[i][j]);
			}
			printf("\n");
		}
	}

	//행과 열의 합 구하기
	if (0)
	{
		int ar1[4][5] = { {10, 20, 30, 40 }, { 50, 60, 70, 80 }, { 90, 100, 110, 120 } };

		int i, j;

		//1. 행의 합 구하기
		for (i = 0; i < 3; i++)//행
			for (j = 0; j < 4; j++)//열
				ar1[i][4] += ar1[i][j];

		//2. 열의 합 구하기
		for (j = 0; j < 5; j++)//열
			for (i = 0; i < 3; i++)//행
				ar1[3][j] += ar1[i][j];
		
		//3. 결과값 출력
		for (i = 0; i < 4; i++)//행
		{
			for (j = 0; j < 5; j++)//열
			{
				printf("%d\t", ar1[i][j]);
			}
			printf("\n");
		}
	}

	//값과 주소 연산자 사용하기
	if (1)
	{
		int ar[2][3] = { 1, 2, 3, 4, 5, 6 };

		printf("1. %p\n", ar);//주소

		printf("2. %p\n", ar[0]);//주소
		printf("3. %d\n", ar[0][1]);//값-2
		printf("4. %d\n", *(* (ar + 0) + 1));//값-2
		
		printf("5. %p\n", ar[1]);//주소
		printf("6. %d\n", ar[1][1]);//값-5
		printf("7. %d\n", *(*(ar + 1) + 1));//값-5
	}
}